<?php

$city_array = array(
    "Омская область" => array(
        "Исилькуль",
        "Калачинск",
        "Называевск",
        "Омск",
        "Тара",
        "Тюкалинск"
    ),
    "Оренбургская область" => array(
        "Абдулино",
        "Бугуруслан",
        "Бузулук",
        "Гай",
        "Кувандык",
        "Медногорск",
        "Новотроицк",
        "Оренбург",
        "Орск",
        "Соль-Илецк",
        "Сорочинск",
        "Ясный"
    ),
    "Орловская область" => array(
        "Болхов",
        "Дмитровск",
        "Ливны",
        "Малоархангельск",
        "Мценск",
        "Новосиль",
        "Орёл"
    ),
    "Пензенская область" => array(
        "Белинский",
        "Городище",
        "Заречный",
        "Каменка",
        "Кузнецк",
        "Нижний Ломов",
        "Никольск",
        "Пенза",
        "Сердобск",
        "Спасск",
        "Сурск"
    )
)

# и тд. если честно не знаю на изусть все эти области и города, и думаю этого хватит.
